# У цьому файлі міститься сценарій гри.

# Гра починається тут.
label start:

    # frame a0
    scene bg paper
    show treveller near fire:
        align (0.2, 0.0)
    show folket:
        align (0.5, 0.0)

    """
    Ця історія про менестреля Фолькета з Марселю, який вирушив у подорож по звивистій дорозі з Авіньйона в Тулузу. Коли сонце майже сіло, він втомився і вирішив зупинитися на ніч.

    Фолькет розклав багаття, щоб зігрітися.   З собою в нього була одна дивна старовинна книга. Читаючи її,  він провалився в сон...
    """


    # frame a1
    scene bg paper
    show old-book at truecenter
    with fade
    pause 1.0


    # frame b1
    scene bg tale
    show folket at left_page
    with fade

    """
    Прийшовши до тями, Фолькет, опинився в дивному місці.

    Сонце світило якось приглушено, птахів не було чутно. Вдалені він побачив старовинний замок.

    Наближаючись до нього, його зустрів лютий на вигляд півень, на ім'я Шантеклер.
    """

    show piven at right_page
    with dissolve

    "Півень був захисником замку і погрожував напасти, якщо він негайно не піде."


    # frame b2
    "Шантеклер подивився на Фолкета гострим поглядом. — Стій, менестрелю, — сказав Шантеклер. — Чому ви прагнете до замку?"

    "Я...я всього лише мандрівний менестрель, який шукає притулку на ніч. Я не хочу зла."


    # frame b3
    hide folket

    """
    Дорога до замку небезпечна, і тільки розумні можуть пройти. Докажи свою кмітливість, менестрелю.

    Дай відповідь на цю загадку:
    я кажу без рота і чую без вух. Я не маю тіла, але я оживаю з вітром.
    Що я таке?
    """


label frame_b4:
    show folket at left_page
    hide piven

    menu:
        "Хм, це складно. Дай подумати:"

        "Це барабан?":
            hide folket
            show piven at right_page
            "Неправильно! Ти не кмітливий, менестреле, бо ти неправильно здогадався. Можеш спробувати ще раз."
            jump frame_b4
        "Це дзвіночок?":
            hide folket
            show piven at right_page
            "Ха!  Твої пісні можуть чарувати слух, але твій розум нудний, як струни арфи. Але я дам тобі ще один шанс."
            jump frame_b4
        "Це труба?":
            hide folket
            show piven at right_page
            "Правильно! Ти зробив це, Фолькет. Ти можеш пройти."

    # frame b5
    show folket at left_page

    "Уф, це було складно. Дякую за виклик, Півень Шантеклер."

    """
    Не такий вже ти і розумний...

    Задоволення було тільки моїм, менестрель. До наступного разу!
    """

    # frame c1
    scene bg tale
    show folket at left_page
    show landscape at right_page
    with fade

    """
    Сповнений надії, Фолькет вирушив далі по дорозі до замку...

    Але несподівано дорогу йому заступив олень з велетенськими рогами.
    """

    # frame c2
    hide folket
    hide landscape
    show olen at right_page with moveinright

    """
    Коли менестрель наблизився, олень стояв високий і гордий, перегороджуючи йому шлях.

    Стій, менестрелю!  Ти повинен відповісти на мою загадку, якщо сподіваєшся продовжити свою подорож.
    """

    # TODO


    # end
    scene bg paper
    show folket at truecenter:
        zoom 2.0

    """
    Фолькет прокинувся. Сонце сходило. Світ навкруги був цілком реальний.

    Дивна книга лежала поруч.
    Але її обкладинка дещо змінилася...
    """

    # На цьому гра закінчується.
    return
