# TODO: Translation updated at 2023-02-04 08:08

# game/script.rpy:15
translate english start_4a5d9588:

    # "Ця історія про менестреля Фолькета з Марселю, який вирушив у подорож по звивистій дорозі з Авіньйона в Тулузу. Коли сонце майже сіло, він втомився і вирішив зупинитися на ніч."
    "Ця історія про менестреля Фолькета з Марселю, який вирушив у подорож по звивистій дорозі з Авіньйона в Тулузу. Коли сонце майже сіло, він втомився і вирішив зупинитися на ніч."

# game/script.rpy:15
translate english start_eb7ba05b:

    # "Фолькет розклав багаття, щоб зігрітися. З собою в нього була одна дивна старовинна книга. Читаючи її, він провалився в сон..."
    "Фолькет розклав багаття, щоб зігрітися. З собою в нього була одна дивна старовинна книга. Читаючи її, він провалився в сон..."

# game/script.rpy:34
translate english start_12ef0d34:

    # "Прийшовши до тями, Фолькет, опинився в дивному місці."
    "Прийшовши до тями, Фолькет, опинився в дивному місці."

# game/script.rpy:34
translate english start_95467a96:

    # "Сонце світило якось приглушено, птахів не було чутно. Вдалені він побачив старовинний замок."
    "Сонце світило якось приглушено, птахів не було чутно. Вдалені він побачив старовинний замок."

# game/script.rpy:34
translate english start_093ba83c:

    # "Наближаючись до нього, його зустрів лютий на вигляд півень, на ім'я Шантеклер."
    "Наближаючись до нього, його зустрів лютий на вигляд півень, на ім'я Шантеклер."

# game/script.rpy:45
translate english start_6f04ca7a:

    # "Півень був захисником замку і погрожував напасти, якщо він негайно не піде."
    "Півень був захисником замку і погрожував напасти, якщо він негайно не піде."

# game/script.rpy:49
translate english start_d3e83f74:

    # "Шантеклер подивився на Фолкета гострим поглядом. — Стій, менестрелю, — сказав Шантеклер. — Чому ви прагнете до замку?"
    "Шантеклер подивився на Фолкета гострим поглядом. — Стій, менестрелю, — сказав Шантеклер. — Чому ви прагнете до замку?"

# game/script.rpy:51
translate english start_3bf385c9:

    # "Я...я всього лише мандрівний менестрель, який шукає притулку на ніч. Я не хочу зла."
    "Я...я всього лише мандрівний менестрель, який шукає притулку на ніч. Я не хочу зла."

# game/script.rpy:57
translate english start_e3835261:

    # "Дорога до замку небезпечна, і тільки розумні можуть пройти. Докажи свою кмітливість, менестрелю."
    "Дорога до замку небезпечна, і тільки розумні можуть пройти. Докажи свою кмітливість, менестрелю."

# game/script.rpy:57
translate english start_cad7ca62:

    # "Дай відповідь на цю загадку: я кажу без рота і чую без вух. Я не маю тіла, але я оживаю з вітром. Що я таке?"
    "Дай відповідь на цю загадку: я кажу без рота і чую без вух. Я не маю тіла, але я оживаю з вітром. Що я таке?"

# game/script.rpy:76
translate english frame_b4_44f4bb7a:

    # "Неправильно! Ти не кмітливий, менестреле, бо ти неправильно здогадався. Можеш спробувати ще раз."
    "Неправильно! Ти не кмітливий, менестреле, бо ти неправильно здогадався. Можеш спробувати ще раз."

# game/script.rpy:81
translate english frame_b4_192b8f26:

    # "Ха! Твої пісні можуть чарувати слух, але твій розум нудний, як струни арфи. Але я дам тобі ще один шанс."
    "Ха! Твої пісні можуть чарувати слух, але твій розум нудний, як струни арфи. Але я дам тобі ще один шанс."

# game/script.rpy:86
translate english frame_b4_2f2f1523:

    # "Правильно! Ти зробив це, Фолькет. Ти можеш пройти."
    "Правильно! Ти зробив це, Фолькет. Ти можеш пройти."

# game/script.rpy:91
translate english frame_b4_67d827fb:

    # "Уф, це було складно. Дякую за виклик, Півень Шантеклер."
    "Уф, це було складно. Дякую за виклик, Півень Шантеклер."

# game/script.rpy:93
translate english frame_b4_13a7c801:

    # "Не такий вже ти і розумний..."
    "Не такий вже ти і розумний..."

# game/script.rpy:93
translate english frame_b4_d1fafc2d:

    # "Задоволення було тільки моїм, менестрель. До наступного разу!"
    "Задоволення було тільки моїм, менестрель. До наступного разу!"

# game/script.rpy:105
translate english frame_b4_11aa1449:

    # "Сповнений надії, Фолькет вирушив далі по дорозі до замку..."
    "Сповнений надії, Фолькет вирушив далі по дорозі до замку..."

# game/script.rpy:105
translate english frame_b4_739f2a5a:

    # "Але несподівано дорогу йому заступив олень з велетенськими рогами."
    "Але несподівано дорогу йому заступив олень з велетенськими рогами."

# game/script.rpy:116
translate english frame_b4_79c4c9d5:

    # "Коли менестрель наблизився, олень стояв високий і гордий, перегороджуючи йому шлях."
    "Коли менестрель наблизився, олень стояв високий і гордий, перегороджуючи йому шлях."

# game/script.rpy:116
translate english frame_b4_90f3d294:

    # "Стій, менестрелю! Ти повинен відповісти на мою загадку, якщо сподіваєшся продовжити свою подорож."
    "Стій, менестрелю! Ти повинен відповісти на мою загадку, якщо сподіваєшся продовжити свою подорож."

# game/script.rpy:130
translate english frame_b4_4c5674d8:

    # "Фолькет прокинувся. Сонце сходило. Світ навкруги був цілком реальний."
    "Фолькет прокинувся. Сонце сходило. Світ навкруги був цілком реальний."

# game/script.rpy:130
translate english frame_b4_b9690830:

    # "Дивна книга лежала поруч. Але її обкладинка дещо змінилася..."
    "Дивна книга лежала поруч. Але її обкладинка дещо змінилася..."

translate english strings:

    # game/script.rpy:70
    old "Хм, це складно. Дай подумати:"
    new "Хм, це складно. Дай подумати:"

    # game/script.rpy:70
    old "Це барабан?"
    new "Це барабан?"

    # game/script.rpy:70
    old "Це дзвіночок?"
    new "Це дзвіночок?"

    # game/script.rpy:70
    old "Це труба?"
    new "Це труба?"

