# TODO: Translation updated at 2023-02-05 14:40

# game/script/animal_5_boss.rpy:11
translate english boss_2018caa3:

    # "Коли Фолькет продовжив свою подорож до замку, він натрапив на величного та суворого грифона, який сидів на скелі біля дороги. Його звали грифон Prudens."
    "Коли Фолькет продовжив свою подорож до замку, він натрапив на величного та суворого грифона, який сидів на скелі біля дороги. Його звали грифон Prudens."

# game/script/animal_5_boss.rpy:11
translate english boss_3174d497:

    # "Фолькет обережно підійшов до грифона, бо він чув історії про їх лютість та силу. Але коли він наблизився, то помітив, що грифон виглядає сумним і замисленим."
    "Фолькет обережно підійшов до грифона, бо він чув історії про їх лютість та силу. Але коли він наблизився, то помітив, що грифон виглядає сумним і замисленим."

# game/script/animal_5_boss.rpy:23
translate english boss_b48ab736:

    # hryfon "Грифон з цікавістю подивився на Фолькета й сказав: \"Я шукаю сенс життя.\""
    hryfon "Грифон з цікавістю подивився на Фолькета й сказав: \"Я шукаю сенс життя.\""

# game/script/animal_5_boss.rpy:50
translate english frame_f4_892f9a06:

    # player "Хмм, дайно мені трохи часу. \n {a=jump:frame_f4_1}1)Можливо це балада?{/a} \n {a=jump:frame_f4_2}2)Стривай, це жарт?{/a} \n" (advance=False)
    player """
    Хмм, дайно мені трохи часу. \n
    {a=jump:frame_f4_1}1)Можливо це балада?{/a} \n
    {a=jump:frame_f4_2}2)Стривай, це жарт?{/a} \n
    """ (advance=False)

