define character.hryfon = Character(None, kind=character.animal)


label boss:

    call scene_tale
    show folket at left_page
    with fade
    """
    Коли Фолькет продовжив свою подорож до замку, він натрапив на величного та суворого грифона,
    який сидів на скелі біля дороги. Його звали грифон Prudens.

    Фолькет обережно підійшов до грифона, бо він чув історії про їх лютість та силу.
    Але коли він наблизився, то помітив, що грифон виглядає сумним і замисленим.
    """

    show hryfon at right_page with moveinright
    player "Добрий сір, чи можу я запитати, чому ви такий сумний?"

    hryfon """
    Грифон з цікавістю подивився на Фолькета й сказав: \"Я шукаю сенс життя.\"

    Він услизає від мене, скільки б я не розмірковував і як далеко не летів...
    """

    player """
    Можливо, я можу допомогти?
    Я менестрель і зустрічав багато мудреців та дивних істот під час своїх подорожей.
    """

    hryfon """
    Добре, давай подивимося, що ти можеш запропонувати.
    Я загадаю тобі просту загадку.

    Якщо ти зможеш її розгадати, я дозволю тобі пройти далі цілим і неушкодженим...
    """

    hryfon """
    Я легкий, як пір'їнка, але ніхто не може мене втримати.
    Мене можна зламати, зробити, розповісти, погратися, але не твоєю рукою. Що я таке?
    """

label frame_f4:
    player """
    Хмм, дайно мені трохи часу. \n
    {a=jump:frame_f4_1}1)Можливо це балада?{/a} \n
    {a=jump:frame_f4_2}2)Стривай, це жарт?{/a} \n
    """ (advance=False)

    label frame_f4_1:
        hryfon "Грифон Prudens заперечно хитає головою..."
        jump frame_f4
    
    label frame_f4_2:
        hryfon """
        Грифон Prudens схвально киває.
        У тебе гострий розум, менестреле.
        Але пам’ятай, що мудрість
        приходить із знань і досвіду,
        а не лише з розгадування загадок...
        """

label frame_f5:
    hryfon "Від кого ти тікаєш, менестрель? Від небезпеки, від себе, від свого коріння?"

    player "Я...я шукаю кращої долі та цікавих пригод."

    hryfon "Що ти робив раніше на цій дорозі?"

    player "Я співав, складав балади, жартував, відгадував загадки, мандрував світом..."

    hryfon "Чи був ти щасливий на цьому шляху?"

    player "Знаешь, незважаючи на всі проблеми, так, я був щасливий!"

    hryfon """
    Ось ти і відповів на твоє питання про долю.

    Тримайся свого призначення, своїх коренів.

    Проживи своє життя зі змістом і метою.
    Твій шлях - це мандри...
    """

return