image text_bg = Solid("#eeec", xsize=900, ysize=400, align=(0.5, 0.5))


label intro:

    scene bg campfire
    with dissolve

    pause 1.0
    show text_bg with dissolve
    """
    Ця історія про менестреля Фолькета з Марселю, який вирушив у подорож по звивистій дорозі з Авіньйона в Тулузу. Коли сонце майже сіло, він втомився і вирішив зупинитися на ніч.

    Фолькет розклав багаття, щоб зігрітися. З собою в нього була одна дивна старовинна книга. Читаючи її,  він провалився в сон...
    """

return